In [2]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [ ]:
df.loc[:,['salary_year_avg', 'salary_hour_avg']]

        salary_year_avg  salary_hour_avg
0                   NaN              NaN
1                   NaN              NaN
2                   NaN              NaN
3                   NaN              NaN
4                   NaN              NaN
...                 ...              ...
785736              NaN              NaN
785737              NaN              NaN
785738              NaN              NaN
785739              NaN              NaN
785740              NaN              NaN

[785741 rows x 2 columns]

In [ ]:
salary_year_median = df['salary_year_avg'].median()

np.float64(115000.0)

In [8]:
salary_hour_median = df['salary_hour_avg'].median()

In [12]:
df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_median)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(salary_hour_median)

In [15]:
df_filled.loc[:10 ,['salary_year_avg', 'salary_hour_avg']]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [19]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates(subset=['job_title' , 'company_name'])
print(len(df_unique))
print(len(df_filled))

508042
785741